# 11 Handling Duplicates

In [3]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
dataset = pd.read_csv('loan.csv')

In [18]:
# understanding duplicates first
data = {'name':['a', 'b', 'c', 'd', 'a', 'b'], "Eng":[8,8,1,5,8,8], 'Maths':[4,5,6,7,4,5]}
df = pd.DataFrame(data)
df

  name  Eng  Maths
0    a    8      4
1    b    8      5
2    c    1      6
3    d    5      7
4    a    8      4
5    b    8      5

In [16]:
# df['Duplicated'] = df.duplicated()
# df

In [19]:
df.drop_duplicates(keep='first') # also -> df.drop_duplicates(inplace = True)

  name  Eng  Maths
0    a    8      4
1    b    8      5
2    c    1      6
3    d    5      7

In [20]:
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [22]:
dataset.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
609    False
610    False
611    False
612    False
613    False
Length: 614, dtype: bool

In [23]:
dataset.shape

(614, 13)

In [24]:
dataset.drop_duplicates(inplace=True)

In [25]:
dataset.shape # the output shows there was no duplicates

(614, 13)